app/controllers/home_controller.rb

SELECT "repositories".* FROM "repositories"
---
  def index
    @repositories = Repository.all

DELETE FROM "repositories"
---
  def get_repositories
    Repository.delete_all

INSERT INTO "repositories" ("name", "full_name", "url", "description", "language", "stargazers_count", "forks", "open_issues", "watchers", "owner_login", "owner_avatar_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
            end
          end
        end
        Repository.create(attributes)